app/Controllers/Announcement.php

    public function index()
    {
        // Check if user is logged in
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login')->with('error', 'Please login first.');
        }

        // Fetch all announcements ordered by created_at descending (newest first)
        $announcements = $this->announcementModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `announcements`
ORDER BY `created_at` DESC