app/Controllers/Auth.php

    public function dashboard()
    {
        $session = session();

        if (!$session->get('logged_in')) {
            return redirect()->to('/auth/login')->with('error', 'Please login first.');
        }

        $db        = \Config\Database::connect();
        $userModel = new UserModel();

        $userId   = $session->get('user_id');
        $userRole = strtolower($session->get('user_role'));
        $user     = $userModel->find($userId);

        $users = [];
        $courses = [];
        $deadlines = [];
        $enrolledCourses = [];

        try {
            // ✅ ADMIN
            if ($userRole === 'admin') {
                $users = $userModel->select('id, name, email, role')->findAll();

                if ($this->tableExists('courses')) {
                    $courses = $db->table('courses')->get()->getResultArray();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT `id`, `name`, `email`, `role`
FROM `users`
SELECT *
FROM `courses`

            // ✅ TEACHER
            elseif ($userRole === 'teacher') {
                if ($this->tableExists('courses')) {
                    $courses = $db->table('courses')
                        ->where('instructor_id', $userId)
                        ->get()
                        ->getResultArray();
---
SELECT *
FROM `courses`
WHERE `instructor_id` = '2'

            // ✅ STUDENT
            elseif ($userRole === 'student') {
                if ($this->tableExists('courses')) {
                    $courses = $db->table('courses')
                        ->select('id, title, description')
                        ->get()
                        ->getResultArray();
---
SELECT `id`, `title`, `description`
FROM `courses`


                if ($this->tableExists('enrollments')) {
                    // Get enrolled courses
                    $enrolledCourses = $db->table('enrollments')
                        ->select('courses.id, courses.title, courses.description')
                        ->join('courses', 'enrollments.course_id = courses.id')
                        ->where('enrollments.user_id', $userId)
                        ->get()
                        ->getResultArray();
---
SELECT `courses`.`id`, `courses`.`title`, `courses`.`description`
FROM `enrollments`
JOIN `courses` ON `enrollments`.`course_id` = `courses`.`id`
WHERE `enrollments`.`user_id` = '3'