app/Models/AnnouncementModel.php

SELECT *
FROM `announcements`
WHERE `target_role` = 'student'
OR `target_role` = 'all'
ORDER BY `created_at` DESC
---
    public function getAnnouncementsByRole($role)
    {
        return $this->where('target_role', $role)
                   ->orWhere('target_role', 'all')
                   ->orderBy('created_at', 'DESC')
                   ->findAll();